{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_ids": 0,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-DESC",
    "1": "B-INFRA",
    "2": "B-LOC",
    "3": "B-PROB",
    "4": "B-SEV",
    "5": "B-TIME",
    "6": "I-DESC",
    "7": "I-INFRA",
    "8": "I-LOC",
    "9": "I-PROB",
    "10": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-DESC": 0,
    "B-INFRA": 1,
    "B-LOC": 2,
    "B-PROB": 3,
    "B-SEV": 4,
    "B-TIME": 5,
    "I-DESC": 6,
    "I-INFRA": 7,
    "I-LOC": 8,
    "I-PROB": 9,
    "O": 10
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "transformers_version": "4.56.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 31923
}
